app/Models/AlunoModel.php

SELECT *
FROM `alunos`
WHERE `matricula` = '36'
 LIMIT 1
---
    public function getAlunoById($matricula)
    {
        return $this->where('matricula',$matricula)->first();

SELECT *
FROM `alunos`
WHERE `login_id` = '300'
 LIMIT 1
---
    public function getAlunoByLoginId($login_id)
    {
        return $this->where('login_id',$login_id)->first();