app/Models/AlunoInscritoDisciplinaModel.php

    public function getCodigoDisciplinasByAluno($matricula_aluno)
    {
        return $this->select('disciplina_id')->where('aluno_id',$matricula_aluno)->get()->getResultArray();
---
SELECT `disciplina_id`
FROM `aluno_inscrito_disciplinas`
WHERE `aluno_id` = '36'

    public function alunosByDisciplina($codigo)
    {
        return $this->select('alunos.*,usuarios.email')->
        join('alunos','aluno_id = alunos.matricula')->
        join('usuarios','usuarios.id=alunos.login_id')->
        where('disciplina_id',$codigo)->get()->getResultArray();
---
SELECT `alunos`.*, `usuarios`.`email`
FROM `aluno_inscrito_disciplinas`
JOIN `alunos` ON `aluno_id` = `alunos`.`matricula`
JOIN `usuarios` ON `usuarios`.`id`=`alunos`.`login_id`
WHERE `disciplina_id` = '71'