app/Models/DisciplinaModel.php

SELECT `professores`.`nome` as `profNome`, `professores`.`matricula` as `matricula`, `disciplinas`.`codigo`, `disciplinas`.`nome`, `disciplinas`.`descricao`, `disciplinas`.`professor_id`
FROM `disciplinas`
LEFT JOIN `professores` ON `disciplinas`.`professor_id` = `professores`.`matricula`
ORDER BY `nome` ASC
---
    public function getAllDisciplinas($sort_by = 'nome',$sort_order = 'ASC')
    {
        return $this->select('professores.nome as profNome,professores.matricula as matricula,disciplinas.codigo,disciplinas.nome,disciplinas.descricao,disciplinas.professor_id')->
        join('professores','disciplinas.professor_id = professores.matricula','left')->orderBy($sort_by,$sort_order)->get()->getResultArray();

SELECT *
FROM `disciplinas`
WHERE `professor_id` IS NULL
ORDER BY `nome` ASC
---
    public function disciplinasSemProfessor()
    {
        return $this->where('professor_id',null)->orderBy('nome','asc')->get()->getResultArray();

SELECT *
FROM `disciplinas`
WHERE `codigo` NOT IN (SELECT `disciplinas`.`codigo` FROM `aluno_inscrito_disciplinas` JOIN `disciplinas` ON `disciplina_id` = `disciplinas`.`codigo` WHERE `aluno_id` = '36')
---
    public function disciplinasLivres($matriculaAluno)
    {
        $subQuery = $this->db->table('aluno_inscrito_disciplinas')->select('disciplinas.codigo')->join('disciplinas','disciplina_id = disciplinas.codigo')->where('aluno_id',$matriculaAluno);
    //    dd($subQuery);
        return $this->whereNotIn('codigo',$subQuery)->get()->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `disciplinas`
LEFT JOIN `professores` ON `disciplinas`.`professor_id` = `professores`.`matricula`
WHERE `codigo` NOT IN ('','16','14','11','12','8','77','7','9')
SELECT `professores`.`nome` as `profNome`, `disciplinas`.`codigo`, `disciplinas`.`nome`, `disciplinas`.`descricao`, `disciplinas`.`professor_id`
FROM `disciplinas`
LEFT JOIN `professores` ON `disciplinas`.`professor_id` = `professores`.`matricula`
WHERE `codigo` NOT IN ('','16','14','11','12','8','77','7','9')
ORDER BY `disciplinas`.`nome` ASC
 LIMIT 6
---
    public function disciplinasLivresPage($codigo_disciplinas_aluno,$page_number,$page_name)
    {
        if (count($codigo_disciplinas_aluno) == 0) {
            array_push($codigo_disciplinas_aluno,'nulo');
        }
        // dd($codigo_disciplinas_aluno);
        return $this->
        select('professores.nome as profNome,disciplinas.codigo,disciplinas.nome,disciplinas.descricao,disciplinas.professor_id')->
        join('professores','disciplinas.professor_id = professores.matricula','left')->
        whereNotIn('codigo',$codigo_disciplinas_aluno)->orderBy('disciplinas.nome','asc')->
        paginate($page_number,$page_name);

SELECT *
FROM `disciplinas`
WHERE `codigo` IN (SELECT `disciplinas`.`codigo` FROM `aluno_inscrito_disciplinas` JOIN `disciplinas` ON `disciplina_id` = `disciplinas`.`codigo` WHERE `aluno_id` = '36')
---
    public function disciplinasAluno($matriculaAluno)
    {
        $subQuery = $this->db->table('aluno_inscrito_disciplinas')->select('disciplinas.codigo')->join('disciplinas','disciplina_id = disciplinas.codigo')->where('aluno_id',$matriculaAluno);
    //    dd($subQuery);
        return $this->whereIn('codigo',$subQuery)->get()->getResultArray();

SELECT count(*) as count
FROM `disciplinas`
WHERE `codigo` NOT IN ('','16','14','11','12','8','77','7','9')
---
    public function countDisciplinasLivres($codigo_disciplinas_aluno)
    {
        return $this->select('count(*) as count')->whereNotIn('codigo',$codigo_disciplinas_aluno)->get()->getResultArray()[0]['count'];