app/Models/ProfessorModel.php

    public function getAllProfessores($sort_by = 'nome',$sort_order = 'ASC')
    {
        return $this->select('professores.nome,professores.matricula,usuarios.email,usuarios.data_matricula')->
        join('usuarios','professores.login_id = usuarios.id')->orderBy($sort_by,$sort_order)->get()->getResultArray();
---
SELECT `professores`.`nome`, `professores`.`matricula`, `usuarios`.`email`, `usuarios`.`data_matricula`
FROM `professores`
JOIN `usuarios` ON `professores`.`login_id` = `usuarios`.`id`
ORDER BY `nome` ASC