app/Models/UsuarioModel.php

    public function verificaTipoLogin($email,$senha)
    {
        $user = $this->where('email',$email)->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'vadave3073@agrolivana.com'
 LIMIT 1

    public function novoUsuario($email,$senha,$tipo)
    {
        return $this->insert([
            'email'=>$email,
            'senha'=> password_hash($senha,PASSWORD_DEFAULT),
            'tipo'=> $tipo
        ],true);
---
INSERT INTO `usuarios` (`email`, `senha`, `tipo`, `data_matricula`, `updated_at`) VALUES ('vadave3073@agrolivana.com', '$2y$10$vxrO9lBuxdJNvSyEghB.VeYLpVRdFtKIll3gUWbBuphpUj4GZ9t5O', 'A', '2022-07-29', '2022-07-29')

    public function getUsuariobyId($id)
    {
        return $this->where('id',$id)->first();
---
SELECT *
FROM `usuarios`
WHERE `id` = '12'
 LIMIT 1